{
  "q_and_a_slide.html": "A centered single-column Q&A/closing slide with a large bold blue title, a prominent supporting paragraph and a thank-you line, ideal for ending presentations and inviting audience questions.",
  "comparison_table_2_item.html": "Centered large title above a responsive three-column comparison table (Feature + Option A + Option B) styled with Tailwind, ideal for clear side-by-side comparisons of pricing, performance, support, and other product/service attributes.",
  "process_flow_diagram.html": "Centered large title with a horizontal three-step flow layout—each step shown as a numbered circular icon with a short title and description separated by arrows—ideal for presenting sequential processes, roadmaps, or project phase overviews.",
  "two_column.html": "Centered bold title with two equal, card-styled side-by-side columns (each containing a subheading and paragraph) ideal for concise comparisons, pros/cons, or parallel summaries of two viewpoints.",
  "title_slide.html": "A minimal, full-screen dark cover slide with a centered large bold title and smaller subtitle, ideal for presentation intros or section breaks.",
  "content_slide.html": "A dark-themed single-slide layout with a centered large title and a scrollable main content area underneath, ideal for long-form text, detailed explanations, or embedded HTML content.",
  "title.html": "A minimalist, centered cover/title slide with a large blue main heading and a smaller subtitle under a blue bottom border, ideal for opening slides or section intros to display the presentation title and presenter information.",
  "data_chart_placeholder.html": "A centered slide with a bold top title, a large bordered full-width chart placeholder in the middle and a short explanatory caption beneath, ideal for displaying data visualizations (bar/pie/line charts) and highlighting key insights.",
  "testimonial_carousel_single.html": "A centered, rounded testimonial card with a prominent large italic quote and a client avatar plus name/title beneath, ideal for showcasing customer testimonials or client quotes on a slide or landing page.",
  "concept_definition_card.html": "A centered, card-style single-column slide featuring a prominent blue headline and a short descriptive paragraph, ideal for presenting a concept definition or concise key-point summary.",
  "call_to_action_full_width.html": "A full-width, centered call-to-action slide featuring a bold headline, supporting subheading and large rounded CTA button on a solid colored backdrop — ideal for signup prompts, product trials, or campaign landing slides.",
  "feature_showcase_3_column.html": "Centered slide title with a three-column row of icon-led feature cards (icon, heading, short description), ideal for spotlighting three core product features or benefits.",
  "key_takeaways.html": "Centered bold title with a vertical stack of three rounded, numbered content cards (large left-side numerals with heading and descriptive text on the right), ideal for presenting key takeaways, prioritized insights, or action items.",
  "timeline_event_list.html": "Centered vertical timeline slide with a prominent title and alternating left/right milestone cards connected by a central vertical line, ideal for showcasing project milestones or chronological events.",
  "icon_grid_4x4.html": "Centered large title with a 4×4 responsive grid of icon-labeled rounded tiles, ideal for visually presenting core values, features, skills, or product capabilities at a glance.",
  "section_header.html": "A minimal centered section-header slide featuring a large bold title inside a rounded pale-blue card on a full-screen white background, ideal for section breaks or chapter titles.",
  "image_caption.html": "Centered, large bordered and rounded image with a bold blue caption underneath, ideal for highlighting a single visual (photo, diagram, or screenshot) with a short, impactful description or for section breaks.",
  "quote_with_attribution.html": "A centered, full-screen quote slide featuring a large italic serif quotation with a blue left rule and a smaller blue attribution underneath—ideal for highlighting a powerful quote or key message to emphasize during a presentation.",
  "team_member_profile.html": "A centered, two-column team profile slide with a left circular portrait and right-side large name, role and descriptive bio—ideal for introducing team members or speaker/speaker bios.",
  "key_statistic_highlight.html": "Centered single-statistic highlight slide featuring a large prominent percentage and bold headline with a short supporting description beneath, ideal for showcasing a key metric, KPI, or impactful statistic.",
  "map_location_highlight.html": "Centered large title with a wide rounded map image containing absolute-positioned callout cards for locations and a short explanatory caption beneath — ideal for showcasing key geographic locations or office branches.",
  "comparison_slide.html": "Dark-themed slide with a large centered title and two equal, scrollable side-by-side content panels each featuring a colored subheading, ideal for comparisons, pros/cons, or parallel lists of detailed text.",
  "problem_solution_split.html": "A two-column, half-and-half slide with contrasting colored panels and prominent headings for side-by-side bullet lists, ideal for presenting problems vs. solutions or before/after comparisons."
}
